ThuanLeUte/nrf52832-ads1292-fw/app/project/ble_peripheral/ble_app_template/main.c
  ecg_init.evt_handler          = NULL;
  ecg_init.support_notification = true;
  ecg_init.p_report_ref         = NULL;

  ecg_init.bl_rd_sec        = SEC_OPEN;
  ecg_init.bl_cccd_wr_sec   = SEC_OPEN;
  ecg_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_ecg_init(&m_ecg, &ecg_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for ECG service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void sts_service_init(void)
{
  uint32_t           err_code;
  ble_sts_init_t     sts_init;

  // Initialize ECG
  memset(&sts_init, 0, sizeof(sts_init));

  sts_init.evt_handler          = NULL;
  sts_init.support_notification = true;
  sts_init.p_report_ref         = NULL;

  sts_init.bl_rd_sec        = SEC_OPEN;
  sts_init.bl_cccd_wr_sec   = SEC_OPEN;
  sts_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_sts_init(&m_sts, &sts_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for GYS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void gys_service_init(void)
{
  uint32_t           err_code;
  ble_gys_init_t     gys_init;

// Initialize GYS
  memset(&gys_init, 0, sizeof(gys_init));

  gys_init.evt_handler          = NULL;
  gys_init.support_notification = true;
  gys_init.p_report_ref         = NULL;

  gys_init.bl_rd_sec        = SEC_OPEN;
  gys_init.bl_cccd_wr_sec   = SEC_OPEN;
  gys_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_gys_init(&m_gys, &gys_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for MGS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void mgs_service_init(void)
{
  uint32_t           err_code;
  ble_mgs_init_t     mgs_init;

// Initialize MGS
  memset(&mgs_init, 0, sizeof(mgs_init));

  mgs_init.evt_handler          = NULL;
  mgs_init.support_notification = true;
  mgs_init.p_report_ref         = NULL;

  mgs_init.bl_rd_sec        = SEC_OPEN;
  mgs_init.bl_cccd_wr_sec   = SEC_OPEN;
  mgs_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_mgs_init(&m_mgs, &mgs_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for BAS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void bas_service_init(void)
{
  uint32_t           err_code;
  ble_bas_init_t     bas_init;

  // Initialize Battery Service.
  memset(&bas_init, 0, sizeof(bas_init));

  bas_init.evt_handler          = NULL;
  bas_init.support_notification = true;
  bas_init.p_report_ref         = NULL;
  bas_init.initial_batt_level   = 100;

  // Here the sec level for the Battery Service can be changed/increased.
  bas_init.bl_rd_sec        = SEC_OPEN;
  bas_init.bl_cccd_wr_sec   = SEC_OPEN;
  bas_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_bas_init(&m_bas, &bas_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for DIS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void dis_service_init(void)
{
  uint32_t           err_code;
  ble_dis_init_t     dis_init;

  // Initialize Device Information Service.
  memset(&dis_init, 0, sizeof(dis_init));

  ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

  dis_init.dis_char_rd_sec = SEC_OPEN;

  err_code = ble_dis_init(&dis_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for initializing services that will be used by the application.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void services_init(void)
{
  uint32_t           err_code;
  nrf_ble_qwr_init_t qwr_init = {0};

  // Initialize Queued Write Module.
  qwr_init.error_handler = nrf_qwr_error_handler;

  err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
  APP_ERROR_CHECK(err_code);

  // Initialize Custom Service
  acs_service_init();
  mgs_service_init();
  gys_service_init();
  ecg_service_init();
  sts_service_init();

  // Initialize Battery Service.
  bas_service_init();

  // Initialize Device Information Service.
  dis_service_init();
}

/**
 * @brief         Function for handling an event from the Connection Parameters Module.
 *
 * @param[in]     p_evt     Event received from the Connection Parameters Module.
 *
 * @attention     None
 *
 * @return        None
 */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt)
{
  uint32_t err_code;

  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
  {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}

/**
 * @brief         Function for handling errors from the Connection Parameters module.
 *
 * @param[in]     nrf_error  Error code containing information about what went wrong.
 *
 * @attention     None
 *
 * @return        None
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

/**
 * @brief         Function for initializing the Connection Parameters module.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void conn_params_init(void)
{
  uint32_t               err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));

  cp_init.p_conn_params                  = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail             = false;
  cp_init.evt_handler                    = on_conn_params_evt;
  cp_init.error_handler                  = conn_params_error_handler;

  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for putting the chip into sleep mode.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void sleep_mode_enter(void)
{
  uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
  APP_ERROR_CHECK(err_code);

