ThuanLeUte/nrf52832-ads1292-fw/app/project/ble_peripheral/ble_app_template/main.c
  sys_bm_get_level_in_percent(&battery_level);
  sum_battery_level += battery_level;
  battery_cal_time ++;

  if (battery_cal_time >= 10)
  {
    battery_level = sum_battery_level / battery_cal_time;
    // NRF_LOG_INFO( "Battery avg : %d percent", battery_level);
    battery_cal_time  = 0;
    sum_battery_level = 0;

   ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
  }
}

/**
 * @brief         Function for handling the body temperature update
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void sensors_value_update(void)
{
  mpu9250_scaled_data_t acc_data;
  mpu9250_scaled_data_t gyr_data;

  bsp_gyro_accel_get(&acc_data, &gyr_data);

  // NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
  // NRF_LOG_INFO("Acc X Axis: %d", acc_data.x);
  // NRF_LOG_INFO("Acc Y Axis: %d", acc_data.y);
  // NRF_LOG_INFO("Acc Z Axis: %d", acc_data.z);
  // NRF_LOG_INFO("-----------------------------------");
  // NRF_LOG_INFO("Gyr X Axis: %d", gyr_data.x);
  // NRF_LOG_INFO("Gyr Y Axis: %d", gyr_data.y);
  // NRF_LOG_INFO("Gyr Z Axis: %d", gyr_data.z);
  // NRF_LOG_INFO("++++++++++++++++++++++++++++++++++++");
  // NRF_LOG_INFO("");

  ble_acs_acc_update(&m_acs, (uint16_t)acc_data.x, BLE_CONN_HANDLE_ALL, BLE_ACS_AXIS_X_CHAR);
  ble_acs_acc_update(&m_acs, (uint16_t)acc_data.y, BLE_CONN_HANDLE_ALL, BLE_ACS_AXIS_Y_CHAR);
  ble_acs_acc_update(&m_acs, (uint16_t)acc_data.z, BLE_CONN_HANDLE_ALL, BLE_ACS_AXIS_Z_CHAR);

  ble_mgs_mag_update(&m_mgs, (uint16_t)gyr_data.x, BLE_CONN_HANDLE_ALL, BLE_MGS_AXIS_X_CHAR);
  ble_mgs_mag_update(&m_mgs, (uint16_t)gyr_data.y, BLE_CONN_HANDLE_ALL, BLE_MGS_AXIS_Y_CHAR);
  ble_mgs_mag_update(&m_mgs, (uint16_t)gyr_data.z, BLE_CONN_HANDLE_ALL, BLE_MGS_AXIS_Z_CHAR);

  ble_gys_gyr_update(&m_gys, (uint16_t)gyr_data.x, BLE_CONN_HANDLE_ALL, BLE_GYS_AXIS_X_CHAR);
  ble_gys_gyr_update(&m_gys, (uint16_t)gyr_data.y, BLE_CONN_HANDLE_ALL, BLE_GYS_AXIS_Y_CHAR);
  ble_gys_gyr_update(&m_gys, (uint16_t)gyr_data.z, BLE_CONN_HANDLE_ALL, BLE_GYS_AXIS_Z_CHAR);
}

/**
 * @brief         Function for starting application timers.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void application_timers_start(void)
{
  ret_code_t err_code;

  // Start application timers.
  err_code = app_timer_start(m_sensors_timer_id, SENSORS_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);


  err_code =  app_timer_start(m_battery_timer_id, BATT_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/* End of fi le -------------------------------------------------------- */
